#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/statuc_devops/armageddon-github-actions/runs/run-mYTx4pSiGBKi6yam

Waiting for the plan to start...

Terraform v1.10.4
on linux_amd64
Initializing plugins and modules...
aws_vpc.VPC-B-NewYork-Test: Refreshing state... [id=vpc-0c03aaabf0a5b8717]
aws_eip.eip_NY: Refreshing state... [id=eipalloc-0fff989df47aececd]
aws_internet_gateway.igw_NY: Refreshing state... [id=igw-0bc699bfba0234bc1]
aws_security_group.ASG01-SG02-NY-TG80: Refreshing state... [id=sg-067d76328a74d5b71]
aws_subnet.private-us-east-1a: Refreshing state... [id=subnet-0a359f567d20a13f2]
aws_security_group.ASG01-SG03-NY-servers: Refreshing state... [id=sg-0c33f040f7797875a]
aws_subnet.public-us-east-1a: Refreshing state... [id=subnet-0a71a17a020bef519]
aws_security_group.ASG01-SG01-NY-LB01: Refreshing state... [id=sg-024a1a69829adc70d]
aws_subnet.private-us-east-1b: Refreshing state... [id=subnet-0b880ea62d92c9aa5]
aws_subnet.public-us-east-1b: Refreshing state... [id=subnet-0fc1a57b3ee04dcfb]
aws_nat_gateway.nat_NY: Refreshing state... [id=nat-002a47124a0221f0c]
aws_subnet.private-us-east-1a: Drift detected (delete)
aws_subnet.public-us-east-1b: Drift detected (delete)
aws_subnet.public-us-east-1a: Drift detected (delete)
aws_security_group.ASG01-SG01-NY-LB01: Drift detected (delete)
aws_internet_gateway.igw_NY: Drift detected (delete)
aws_vpc.VPC-B-NewYork-Test: Drift detected (delete)
aws_security_group.ASG01-SG02-NY-TG80: Drift detected (delete)
aws_nat_gateway.nat_NY: Drift detected (delete)
aws_eip.eip_NY: Drift detected (delete)
aws_subnet.private-us-east-1b: Drift detected (delete)
aws_security_group.ASG01-SG03-NY-servers: Drift detected (delete)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_eip.eip_NY has been deleted
  - resource "aws_eip" "eip_NY" {
      - id                       = "eipalloc-0fff989df47aececd" -> null
        tags                     = {
            "Name" = "eip_NY"
        }
        # (15 unchanged attributes hidden)
    }

  # aws_internet_gateway.igw_NY has been deleted
  - resource "aws_internet_gateway" "igw_NY" {
      - id       = "igw-0bc699bfba0234bc1" -> null
        tags     = {
            "Name"    = "application_NY_IGW"
            "Owner"   = "Frodo"
            "Planet"  = "Arda"
            "Service" = "application1"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_nat_gateway.nat_NY has been deleted
  - resource "aws_nat_gateway" "nat_NY" {
      - id                   = "nat-002a47124a0221f0c" -> null
        tags                 = {
            "Name" = "nat_NY"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_subnet.private-us-east-1a has been deleted
  - resource "aws_subnet" "private-us-east-1a" {
      - id                                             = "subnet-0a359f567d20a13f2" -> null
        tags                                           = {
            "Name"    = "private-us-east-1a"
            "Owner"   = "Frodo"
            "Planet"  = "Arda"
            "Service" = "application1"
        }
        # (19 unchanged attributes hidden)
    }

  # aws_subnet.private-us-east-1b has been deleted
  - resource "aws_subnet" "private-us-east-1b" {
      - id                                             = "subnet-0b880ea62d92c9aa5" -> null
        tags                                           = {
            "Name"    = "private-us-east-1b"
            "Owner"   = "Frodo"
            "Planet"  = "Arda"
            "Service" = "application1"
        }
        # (19 unchanged attributes hidden)
    }

  # aws_subnet.public-us-east-1a has been deleted
  - resource "aws_subnet" "public-us-east-1a" {
      - id                                             = "subnet-0a71a17a020bef519" -> null
        tags                                           = {
            "Name"    = "public-us-east-1a"
            "Owner"   = "Frodo"
            "Planet"  = "Arda"
            "Service" = "application1"
        }
        # (19 unchanged attributes hidden)
    }

  # aws_subnet.public-us-east-1b has been deleted
  - resource "aws_subnet" "public-us-east-1b" {
      - id                                             = "subnet-0fc1a57b3ee04dcfb" -> null
        tags                                           = {
            "Name"    = "public-us-east-1b"
            "Owner"   = "Frodo"
            "Planet"  = "Arda"
            "Service" = "application1"
        }
        # (19 unchanged attributes hidden)
    }

  # aws_vpc.VPC-B-NewYork-Test has been deleted
  - resource "aws_vpc" "VPC-B-NewYork-Test" {
      - id                                   = "vpc-0c03aaabf0a5b8717" -> null
        tags                                 = {
            "Name"    = "VPC-B-NewYork-Test"
            "Owner"   = "Frodo"
            "Planet"  = "Arda"
            "Service" = "application1"
        }
        # (20 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.eip_NY will be created
  + resource "aws_eip" "eip_NY" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "eip_NY"
        }
      + tags_all             = {
          + "Name" = "eip_NY"
        }
      + vpc                  = true
    }

  # aws_internet_gateway.igw_NY will be created
  + resource "aws_internet_gateway" "igw_NY" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"    = "application_NY_IGW"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + tags_all = {
          + "Name"    = "application_NY_IGW"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.nat_NY will be created
  + resource "aws_nat_gateway" "nat_NY" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "nat_NY"
        }
      + tags_all             = {
          + "Name" = "nat_NY"
        }
    }

  # aws_route_table.private_NY will be created
  + resource "aws_route_table" "private_NY" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "private_NY"
        }
      + tags_all         = {
          + "Name" = "private_NY"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public_NY will be created
  + resource "aws_route_table" "public_NY" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "public_NY"
        }
      + tags_all         = {
          + "Name" = "public_NY"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private-us-east-1a will be created
  + resource "aws_route_table_association" "private-us-east-1a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private-us-east-1b will be created
  + resource "aws_route_table_association" "private-us-east-1b" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public-us-east-1a will be created
  + resource "aws_route_table_association" "public-us-east-1a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public-us-east-1b will be created
  + resource "aws_route_table_association" "public-us-east-1b" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.ASG01-SG01-NY-LB01 will be created
  + resource "aws_security_group" "ASG01-SG01-NY-LB01" {
      + arn                    = (known after apply)
      + description            = "Allow HTTP inbound traffic to Load Balancer."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "ASG01-SG01-NY-LB01"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "ASG01-SG01-NY-LB01"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + tags_all               = {
          + "Name"    = "ASG01-SG01-NY-LB01"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.ASG01-SG02-NY-TG80 will be created
  + resource "aws_security_group" "ASG01-SG02-NY-TG80" {
      + arn                    = (known after apply)
      + description            = "allow traffic to ASG"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "ASG01-SG02-NY-TG80"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "ASG01-SG02-NY-TG80"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + tags_all               = {
          + "Name"    = "ASG01-SG02-NY-TG80"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.ASG01-SG03-NY-servers will be created
  + resource "aws_security_group" "ASG01-SG03-NY-servers" {
      + arn                    = (known after apply)
      + description            = "Allow SSH and HTTP traffic to production servers"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "ASG01-SG03-NY-servers"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "ASG01-SG03-NY-servers"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + tags_all               = {
          + "Name"    = "ASG01-SG03-NY-servers"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.private-us-east-1a will be created
  + resource "aws_subnet" "private-us-east-1a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.21.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "private-us-east-1a"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "private-us-east-1a"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private-us-east-1b will be created
  + resource "aws_subnet" "private-us-east-1b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.21.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "private-us-east-1b"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "private-us-east-1b"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-us-east-1a will be created
  + resource "aws_subnet" "public-us-east-1a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.21.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "public-us-east-1a"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "public-us-east-1a"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-us-east-1b will be created
  + resource "aws_subnet" "public-us-east-1b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.21.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "public-us-east-1b"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "public-us-east-1b"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.VPC-B-NewYork-Test will be created
  + resource "aws_vpc" "VPC-B-NewYork-Test" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.21.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"    = "VPC-B-NewYork-Test"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + tags_all                             = {
          + "Name"    = "VPC-B-NewYork-Test"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @statuc30721, Action: `pull_request`*